andrewleech/micropython/ports/stm32/mpzephyrport.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 MicroPython Contributors
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// STM32 port integration for Zephyr BLE stack
// Works with both UART HCI transport and STM32WB IPCC transport

#include "py/mpconfig.h"

// Enable hard fault debug output for diagnostics
#include "stm32_it.h"

#if MICROPY_PY_BLUETOOTH && MICROPY_BLUETOOTH_ZEPHYR

#include "py/runtime.h"
#include "py/mphal.h"
#include "extmod/modbluetooth.h"
#include "extmod/mpbthci.h"
#include "extmod/zephyr_ble/hal/zephyr_ble_poll.h"
#include "extmod/zephyr_ble/hal/zephyr_ble_port.h"

// Don't include mpbthciport.h - it defines mp_bluetooth_hci_poll_now as static inline
// which conflicts with our non-inline definition needed by modbluetooth_zephyr.c.
// Instead, declare the specific functions we need from mpbthciport.c:
extern void mp_bluetooth_hci_poll_now_default(void);

#include <string.h>

#include "extmod/zephyr_ble/hal/zephyr_ble_hal.h"
#include "zephyr/device.h"
#include <zephyr/net_buf.h>
#include <zephyr/drivers/bluetooth.h>

// Suppress deprecation warning for bt_buf_get_type()
// The function is deprecated in Zephyr but still works and is the standard API
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
#include <zephyr/bluetooth/buf.h>
#pragma GCC diagnostic pop

// Debug macros - conditional based on ZEPHYR_BLE_DEBUG
#if ZEPHYR_BLE_DEBUG
#define DEBUG_HCI_printf(...) mp_printf(&mp_plat_print, "HCI: " __VA_ARGS__)
#else
#define DEBUG_HCI_printf(...) do {} while (0)
#endif

// Error messages are always printed
#define error_printf(...) mp_printf(&mp_plat_print, "HCI ERROR: " __VA_ARGS__)

// H:4 packet types
#define H4_CMD  0x01
#define H4_ACL  0x02
#define H4_SCO  0x03
#define H4_EVT  0x04

// Zephyr HCI driver callback and device
static const struct device *hci_dev = NULL;
static bt_hci_recv_t recv_cb = NULL;

// Queue for completed HCI packets (received from interrupt context)
// These are deferred for processing in scheduler context to avoid stack overflow
// Increased from 8 to 32 to handle burst of advertising reports during scanning
#define RX_QUEUE_SIZE 32
static struct net_buf *rx_queue[RX_QUEUE_SIZE];
static volatile size_t rx_queue_head = 0;
static volatile size_t rx_queue_tail = 0;


// H:4 packet parser state
typedef enum {
    H4_STATE_TYPE,      // Waiting for packet type byte
    H4_STATE_HEADER,    // Reading packet header
    H4_STATE_PAYLOAD,   // Reading packet payload
} h4_state_t;

static h4_state_t h4_state = H4_STATE_TYPE;
static uint8_t h4_type;
static uint8_t h4_header_buf[4];  // Max header size (ACL: 4 bytes)
static size_t h4_header_idx;
static size_t h4_header_len;
static struct net_buf *h4_buf;
static size_t h4_payload_remaining;

// RX queue helpers (can be called from IRQ context)
static inline bool rx_queue_is_full(void) {
    return ((rx_queue_head + 1) % RX_QUEUE_SIZE) == rx_queue_tail;
}

static inline bool rx_queue_is_empty(void) {
    return rx_queue_head == rx_queue_tail;
}

static bool rx_queue_put(struct net_buf *buf) {
    MICROPY_PY_BLUETOOTH_ENTER
    if (rx_queue_is_full()) {
        MICROPY_PY_BLUETOOTH_EXIT
        return false;
    }
    rx_queue[rx_queue_head] = buf;
    rx_queue_head = (rx_queue_head + 1) % RX_QUEUE_SIZE;
    MICROPY_PY_BLUETOOTH_EXIT
    return true;
}

static struct net_buf *rx_queue_get(void) {
    MICROPY_PY_BLUETOOTH_ENTER
    if (rx_queue_is_empty()) {
        MICROPY_PY_BLUETOOTH_EXIT
        return NULL;
    }
    struct net_buf *buf = rx_queue[rx_queue_tail];
    rx_queue_tail = (rx_queue_tail + 1) % RX_QUEUE_SIZE;
    MICROPY_PY_BLUETOOTH_EXIT
    return buf;
}

// HCI Event Priority Sorting for STM32WB55 IPCC
// The RF coprocessor can send CONNECTION_COMPLETE and DISCONNECT_COMPLETE
// in the same IPCC transaction, causing wrong event ordering.
// We batch-collect events and sort so connection events precede disconnect.

// HCI event codes
#define HCI_EVT_DISCONNECT_COMPLETE 0x05
#define HCI_EVT_CMD_COMPLETE        0x0E
#define HCI_EVT_LE_META             0x3E
#define HCI_LE_SUBEVENT_CONN_COMPLETE           0x01
#define HCI_LE_SUBEVENT_ENHANCED_CONN_COMPLETE  0x0A

// Event priority: lower number = higher priority (processed first)
#define HCI_PRIO_CONNECTION  1  // LE Connection Complete
#define HCI_PRIO_DEFAULT     5  // Most events
#define HCI_PRIO_DISCONNECT  9  // Disconnect Complete (process last)

// Get event priority for sorting (connection events before disconnect)
static int hci_event_get_priority(struct net_buf *buf) {
    if (buf == NULL || buf->len < 4) {
        return HCI_PRIO_DEFAULT;
    }

    const uint8_t *data = buf->data;
    // H4 packet: [type][evt_code][len][params...]
    if (data[0] != H4_EVT) {
        return HCI_PRIO_DEFAULT;  // Not an event
    }

    uint8_t evt_code = data[1];

    // LE Meta Event - check subevent
    if (evt_code == HCI_EVT_LE_META && buf->len >= 4) {
        uint8_t subevent = data[3];
        if (subevent == HCI_LE_SUBEVENT_CONN_COMPLETE ||
            subevent == HCI_LE_SUBEVENT_ENHANCED_CONN_COMPLETE) {
            return HCI_PRIO_CONNECTION;  // High priority
        }
    }

    // Disconnect Complete
    if (evt_code == HCI_EVT_DISCONNECT_COMPLETE) {
        return HCI_PRIO_DISCONNECT;  // Low priority
    }

    return HCI_PRIO_DEFAULT;
}

// Get connection handle from HCI event (for grouping related events)
static uint16_t hci_event_get_conn_handle(struct net_buf *buf) {
    if (buf == NULL || buf->len < 6) {
        return 0xFFFF;  // Invalid handle
    }

    const uint8_t *data = buf->data;
    if (data[0] != H4_EVT) {
        return 0xFFFF;
    }

    uint8_t evt_code = data[1];

