andrewleech/micropython/ports/stm32/mpzephyrport.c
    // LE Connection Complete: [type=04][evt=3E][len][subevent=01][status][handle_lo][handle_hi]...
    if (evt_code == HCI_EVT_LE_META && buf->len >= 7) {
        uint8_t subevent = data[3];
        if (subevent == HCI_LE_SUBEVENT_CONN_COMPLETE ||
            subevent == HCI_LE_SUBEVENT_ENHANCED_CONN_COMPLETE) {
            // Handle is at offset 5-6 (after subevent and status)
            return (data[5] | (data[6] << 8)) & 0x0FFF;
        }
    }

    // Disconnect Complete: [type=04][evt=05][len=4][status][handle_lo][handle_hi][reason]
    if (evt_code == HCI_EVT_DISCONNECT_COMPLETE && buf->len >= 6) {
        // Handle is at offset 4-5 (after status)
        return (data[4] | (data[5] << 8)) & 0x0FFF;
    }

    return 0xFFFF;
}

// Sort batch of HCI events by priority (simple insertion sort, batch is small)
// Events with same connection handle are grouped, with connection events first
static void hci_event_sort_batch(struct net_buf **batch, int count) {
    if (count <= 1) {
        return;
    }

    // Simple insertion sort - batch is typically 2-4 events
    for (int i = 1; i < count; i++) {
        struct net_buf *key = batch[i];
        int key_prio = hci_event_get_priority(key);
        uint16_t key_handle = hci_event_get_conn_handle(key);

        int j = i - 1;
        while (j >= 0) {
            int j_prio = hci_event_get_priority(batch[j]);
            uint16_t j_handle = hci_event_get_conn_handle(batch[j]);

            // Sort by: (1) connection handle, (2) priority within same handle
            bool should_swap = false;
            if (key_handle == j_handle && key_handle != 0xFFFF) {
                // Same connection: sort by priority
                should_swap = (key_prio < j_prio);
            } else if (key_prio < j_prio) {
                // Different connections: connection events first overall
                should_swap = (key_prio == HCI_PRIO_CONNECTION && j_prio == HCI_PRIO_DISCONNECT);
            }

            if (should_swap) {
                batch[j + 1] = batch[j];
                j--;
            } else {
                break;
            }
        }
        batch[j + 1] = key;
    }
}

// Reset H:4 parser state
static void h4_parser_reset(void) {
    h4_state = H4_STATE_TYPE;
    h4_header_idx = 0;
    h4_payload_remaining = 0;
    if (h4_buf) {
        net_buf_unref(h4_buf);
        h4_buf = NULL;
    }
}

// Process one byte through H:4 parser
// Returns true if packet is complete
static bool h4_parser_process_byte(uint8_t byte) {
    switch (h4_state) {
        case H4_STATE_TYPE:
            h4_type = byte;
            h4_header_idx = 0;

            // Determine header length based on packet type
            switch (h4_type) {
                case H4_EVT:
                    h4_header_len = 2;  // opcode + length
                    break;
                case H4_ACL:
                    h4_header_len = 4;  // handle(2) + length(2)
                    break;
                default:
                    error_printf("Unknown H:4 packet type: 0x%02x\n", h4_type);
                    h4_parser_reset();
                    return false;
            }

            h4_state = H4_STATE_HEADER;
            return false;

        case H4_STATE_HEADER:
            h4_header_buf[h4_header_idx++] = byte;

            if (h4_header_idx >= h4_header_len) {
                // Header complete, determine payload length
                size_t payload_len;

                switch (h4_type) {
                    case H4_EVT:
                        payload_len = h4_header_buf[1];  // length byte

                        // Allocate net_buf for event
                        h4_buf = bt_buf_get_evt(h4_header_buf[0], false, K_NO_WAIT);
                        if (!h4_buf) {
                            // Buffer exhaustion - don't reset parser, keep state for retry.
                            // Caller should process work queue to free buffers and retry.
                            error_printf("Failed to allocate event buffer (Issue #12)\n");
                            return false;
                        }

                        // bt_buf_get_evt() -> bt_buf_get_rx() already added H4 type byte
                        // Just add header to buffer (event code + length)
                        net_buf_add_mem(h4_buf, h4_header_buf, h4_header_len);
                        break;

                    case H4_ACL:
                        payload_len = h4_header_buf[2] | (h4_header_buf[3] << 8);

                        // Allocate net_buf for ACL
                        h4_buf = bt_buf_get_rx(BT_BUF_ACL_IN, K_NO_WAIT);
                        if (!h4_buf) {
                            // Buffer exhaustion - don't reset parser, keep state for retry.
                            // Caller should process work queue to free buffers and retry.
                            error_printf("Failed to allocate ACL buffer (Issue #12)\n");
                            return false;
                        }

                        // bt_buf_get_rx(BT_BUF_ACL_IN, ...) already added H4 type byte
                        // Just add header to buffer
                        net_buf_add_mem(h4_buf, h4_header_buf, h4_header_len);
                        break;

                    default:
                        h4_parser_reset();
                        return false;
                }

                if (payload_len == 0) {
                    // No payload, packet is complete
                    h4_state = H4_STATE_TYPE;
                    return true;
                } else {
                    // Transition to payload state
                    h4_payload_remaining = payload_len;
                    h4_state = H4_STATE_PAYLOAD;
                }
            }
            return false;

        case H4_STATE_PAYLOAD:
            if (!h4_buf) {
                error_printf("No buffer in payload state\n");
                h4_parser_reset();
                return false;
            }

            net_buf_add_u8(h4_buf, byte);
            h4_payload_remaining--;

