andrewleech/micropython/ports/stm32/mpzephyrport.c
    // ARCHITECTURAL FIX for regression introduced in commit 6bdcbeb9ef:
    // Connection events were not being received because mp_bluetooth_zephyr_port_run_task()
    // was removed from this function. Restoring it fixes connection event reception.
    //
    // mp_bluetooth_zephyr_port_run_task() calls mp_bluetooth_zephyr_poll() which is CRITICAL
    // for proper HCI event processing. It must be called BEFORE processing buffers.
    mp_bluetooth_zephyr_port_run_task(NULL);

    // Process any remaining queued RX buffers directly
    // This handles buffers that arrived after mp_bluetooth_zephyr_port_run_task() completed
    // Apply same batching/sorting as mp_bluetooth_zephyr_port_run_task for consistency
    struct net_buf *wfi_batch[HCI_EVENT_BATCH_SIZE];
    int wfi_batch_count = 0;
    struct net_buf *buf;
    while (wfi_batch_count < HCI_EVENT_BATCH_SIZE && (buf = rx_queue_get()) != NULL) {
        wfi_batch[wfi_batch_count++] = buf;
    }

    // CRITICAL: Process work queue BEFORE processing events
    // This ensures connection callbacks fire before disconnect events are processed
    if (wfi_batch_count > 0) {
        mp_bluetooth_zephyr_poll();
    }

    // Sort batch by priority (connection events before disconnect)
    if (wfi_batch_count > 1) {
        hci_event_sort_batch(wfi_batch, wfi_batch_count);
    }

    // Process events
    for (int i = 0; i < wfi_batch_count; i++) {
        recv_cb(hci_dev, wfi_batch[i]);
    }

    // Process work queue after wfi events (same pattern as mp_bluetooth_zephyr_port_run_task)
    // Only outermost call processes work to prevent re-entrancy
    extern volatile int mp_bluetooth_zephyr_hci_processing_depth;
    if (wfi_batch_count > 0 && mp_bluetooth_zephyr_hci_processing_depth == 0) {
        mp_bluetooth_zephyr_hci_processing_depth++;
        mp_bluetooth_zephyr_work_process();
        mp_bluetooth_zephyr_hci_processing_depth--;
    }

    // Give IPCC hardware minimal time to complete any ongoing transfers
    // 100μs is sufficient for hardware without introducing significant latency
    mp_hal_delay_us(100);
}

// Stack monitoring helper
static inline uint32_t get_msp(void) {
    uint32_t result;
    __asm volatile ("MRS %0, msp" : "=r" (result));
    return result;
}

// Zephyr HCI driver implementation

static int hci_stm32_open(const struct device *dev, bt_hci_recv_t recv) {
    DEBUG_HCI_printf("hci_stm32_open\n");

    hci_dev = dev;
    recv_cb = recv;

    // Reset H:4 parser
    h4_parser_reset();

    // Initialize HCI transport (UART or IPCC)
    int ret = bt_hci_transport_setup(dev);
    if (ret < 0) {
        error_printf("bt_hci_transport_setup failed: %d\n", ret);
        return ret;
    }

    // Start the soft timer to begin periodic work queue processing
    // This starts the timer which will fire and process work queues + HCI packets
    mp_bluetooth_zephyr_port_poll_in_ms(128);  // Start timer with 128ms delay

    return 0;
}

static int hci_stm32_close(const struct device *dev) {
    DEBUG_HCI_printf("hci_stm32_close\n");

    recv_cb = NULL;
    h4_parser_reset();
    mp_bluetooth_zephyr_poll_stop_timer();

    // Teardown HCI transport
    return bt_hci_transport_teardown(dev);
}

static int hci_stm32_send(const struct device *dev, struct net_buf *buf) {
    (void)dev;

    // Map Zephyr buffer type to H:4 packet type
    uint8_t h4_type;
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
    switch (bt_buf_get_type(buf)) {
        case BT_BUF_CMD:
            h4_type = H4_CMD;
            break;
        case BT_BUF_ACL_OUT:
            h4_type = H4_ACL;
            break;
        default:
            error_printf("Unknown buffer type: %u\n", bt_buf_get_type(buf));
            net_buf_unref(buf);
            return -1;
    }
    #pragma GCC diagnostic pop

    // Build H:4 packet: [type] + data
    size_t total_len = 1 + buf->len;
    uint8_t *h4_packet = m_new(uint8_t, total_len);

    h4_packet[0] = h4_type;
    memcpy(&h4_packet[1], buf->data, buf->len);

    // Trace HCI commands being sent (only when debug enabled)
    #if ZEPHYR_BLE_DEBUG
    if (h4_type == 0x01 && buf->len >= 3) {  // HCI Command
        uint16_t opcode = buf->data[0] | (buf->data[1] << 8);
        uint8_t param_len = buf->data[2];
        DEBUG_HCI_printf("[SEND] HCI Command: opcode=0x%04x param_len=%u\n", opcode, param_len);
    } else if (h4_type == 0x02 && buf->len >= 9) {  // ACL data
        // ACL header: handle(2) + length(2) = 4 bytes
        // L2CAP header: length(2) + CID(2) = 4 bytes
        // ATT data starts at offset 8
        uint16_t handle = (buf->data[0] | (buf->data[1] << 8)) & 0x0FFF;
        uint16_t acl_len = buf->data[2] | (buf->data[3] << 8);
        uint16_t l2cap_len = buf->data[4] | (buf->data[5] << 8);
        uint16_t l2cap_cid = buf->data[6] | (buf->data[7] << 8);
        uint8_t att_opcode = buf->data[8];
        DEBUG_HCI_printf("[SEND] ACL: handle=0x%03x acl_len=%d l2cap_len=%d cid=0x%04x att_op=0x%02x\n",
            handle, acl_len, l2cap_len, l2cap_cid, att_opcode);
        // Hex dump first 16 bytes
        int count = (buf->len > 16 ? 16 : buf->len);
        mp_printf(&mp_plat_print, "[SEND] HEX:");
        for (int i = 0; i < count; i++) {
            mp_printf(&mp_plat_print, " %02x", buf->data[i]);
        }
        mp_printf(&mp_plat_print, " [done %d][A] t=%lu\n", count, (unsigned long)mp_hal_ticks_ms());
    } else {
        DEBUG_HCI_printf("[SEND] type=0x%02x len=%u\n", h4_type, (unsigned int)total_len);
    }

    DEBUG_HCI_printf("HCI_SEND: uart_write len=%u h4=%02x t=%lu\n", (unsigned)total_len, h4_packet[0], (unsigned long)mp_hal_ticks_ms());
    #endif

    // Send via port's transport abstraction (UART or IPCC)
    int ret = mp_bluetooth_hci_uart_write(h4_packet, total_len);

    m_del(uint8_t, h4_packet, total_len);
    net_buf_unref(buf);

    return ret;
}

// HCI driver API structure
static const struct bt_hci_driver_api hci_stm32_api = {
    .open = hci_stm32_open,
    .close = hci_stm32_close,
    .send = hci_stm32_send,
};

